load-test/web-socket-test.yaml
config:
  target: 'ws://localhost:8080/ws'
  processor: './my-functions.js'
  phases:
    - name: 'create v users'  # spawns 10K users in 180 seconds and then waits for 10 minutes
      duration: 180
      arrivalCount: 10000   # 5 minutes
    - name: '10 minutes pause' # 
      pause: 300
scenarios:
  - name: 'orderbook_consumer_user'
    weight: 1
    engine: ws
    flow:
      - function: enableMessageLogging # to handle the messages
      - function: 'createSubscribeMessage'
      - send: '{{subscribe}}'
      - think: 120