load-test/web-socket-test.yaml
config:
  ensure:
    thresholds:
      - 'metric.at_client_latency.p99': 20
  target: 'ws://localhost:8080/ws'
  processor: './my-functions.js'
  phases:
    - duration: 300   # 5 minutes
      arrivalRate: 100  # 100 clients added per second

scenarios:
  - name: 'sending_subscribe_message'
    engine: ws
    flow:
      - function: enableMessageLogging # to handle the messages
      - function: 'createSubscribeMessage'
      - send: '{{subscribe}}'
      - think: 120